<?php

return [
    // پیام‌های موفقیت
    'otp_sent'          => 'کد تأیید ارسال شد.',
    'register_success'  => 'ثبت‌نام با موفقیت انجام شد',
    'login_success'     => 'ورود با موفقیت انجام شد',
    'logout_success'    => 'با موفقیت خارج شدید.',
    'logout_all_success'=> 'از همه دستگاه‌ها خارج شدید.',
    'otp_message' => 'کد ورود شما: :code',
    'unnamed_user'   => 'کاربر جدید',
    'token_refreshed'=> 'توکن شما با موفقیت به‌روزرسانی شد.',

    // پیام‌های خطا
    'phone_required'    => 'شماره موبایل الزامی است.',
    'phone_invalid'     => 'شماره موبایل باید با ۰۹ شروع شود و ۱۱ رقم باشد.',
    'code_required'     => 'کد تأیید الزامی است.',
    'code_invalid'      => 'کد تأیید باید ۶ رقمی باشد.',
    'code_wrong'        => 'کد وارد شده صحیح نیست.',
    'code_expired'      => 'کد منقضی شده است. دوباره درخواست دهید.',
    'code_not_found'    => 'کدی برای این شماره یافت نشد.',
    'code_too_many_tries' => 'تعداد تلاش‌های ناموفق زیاد است. کد جدید بگیرید.',
    'otp_rate_limit'    => 'لطفاً ۲ دقیقه دیگر دوباره تلاش کنید.',
    'unauthorized'      => 'شما اجازه دسترسی به این بخش را ندارید.',
    'refresh_token.required' => 'رفرش توکن الزامی است',
    'refresh_token_required' => 'رفرش توکن الزامی است.'
];
